import type { Product } from '../types/product';

export const products: Product[] = [
  {
    id: 1,
    title: '6.3" Iphone 17 Pro 256 ГБ',
    price: 134999,
    category: 'Смартфоны',
    image: '/images/iphone_17_pro_256.jpg',
    description: `Представляем iPhone 17 Pro, разработанные чтобы стать самыми мощными моделями iPhone. В основе конструкции лежит цельнолитой алюминиевый корпус, обеспечивающий максимальную производительность, ёмкость аккумулятора и долговечность. В системе камер iPhone 17 Pro вы найдете инновации, которые простираются далеко за пределы привычного. Сюда входит самый большой телеобъектив в истории iPhone с фокусным расстоянием до 200 мм, благодаря тетрапризменной конструкции и увеличенному на 56% сенсору.`,
  },
  {
    id: 2,
    title: '6.5" Apple iPhone Air 256 ГБ',
    price: 99999,
    category: 'Смартфоны',
    image: '/images/iphone_air_256.jpg',
    description: `iPhone Air оснащен 6,5-дюймовый дисплеем, при этом толщина корпуса составляет всего 5.6 мм, а вес – 165 г. Это самый тонкий iPhone в истории Apple. Корпус модели выполнен из титана, экран покрыт Ceramic Shield 2. Материал отличается устойчивостью к царапинам. Частота обновления составляет 120 Гц. Пользователям доступна функция Always-On Display. Максимальная яркость – 3000 нит.`,
  },
  {
    id: 3,
    title: '34" Монитор Samsung Odyssey G8',
    price: 84999,
    category: 'Мониторы',
    image: '/images/samsung_odyssey_g8.jpg',
    description: `Монитор Samsung Odyssey G8 G85SD S34DG852SI с изогнутым 34-дюймовым экраном OLED позволяет погрузиться в виртуальный мир. Благодаря времени отклика 0.03 мс и частоте обновления 175 Гц вы сможете быстро реагировать на действия соперника. Стабильность и плавность отображения динамичных кадров осуществляется технологиями адаптивной синхронизации AMD FreeSync Premium и G-Sync Compatible. Технология HDR10 гарантирует глубину темных сцен и оттенков.`,
  },
  {
    id: 4,
    title: 'Apple AirPods Pro 3',
    price: 29999,
    category: 'Наушники',
    image: '/images/airpods_3.jpg',
    description: `AirPods Pro 3 с улучшенной акустической изоляцией автоматически адаптируются к вашим предпочтениям и окружающей обстановке. А обновленные микрофоны ещё больше устраняют нежелательные звуки. Вы слышите только то, что хотите в беспрецедентном аудио-ощущении. AirPods Pro 3 снижают фоновый шум и изолируют голоса во время звонков, поэтому, будь то в автобусе или в кафе - каждый разговор будет громким и чётким.`,
  },
  {
    id: 5,
    title: 'Kingston FURY Beast Black',
    price: 42799,
    category: 'Оперативная память',
    image: '/images/kingston_fury.jpg',
    description: `Оперативная память Kingston FURY Beast Black поколения DDR5 – это высокопроизводительное решение для геймерских и ресурсоемких ПК. Она представлена комплектом из двух модулей суммарным объемом 32 ГБ и тактовой частотой 5600 МГц. Поддержка Intel (XMP) 2.0 позволяет с удобством выполнять разгон. Алюминиевый ребристый радиатор способствует быстрому отведению тепла и помогает предотвратить перегрев чипов памяти. Интегрированная схема управления питанием гарантируют повышенную стабильность в эксплуатации оперативной памяти Kingston FURY Beast.`,
  },
  {
    id: 6,
    title: 'Apple Watch SE 2024 40 mm',
    price: 20699,
    category: 'Смарт-часы и браслеты',
    image: '/images/apple_watch.jpg',
    description: `Простые способы оставаться на связи. Мотивирующие показатели фитнеса. Apple Watch SE 2024 — это большой дисплей Retina, датчики отслеживания физической активности и мощные функции для здоровья и безопасности, часы, с которыми вы оцените каждую секунду. Мощный партнер для любой активности и фитнеса.`,
  },
];
